In [44]:
!pip install pandas
!pip install numpy
import pandas as pd
import numpy as np

Requirement already satisfied: pandas in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: C:\Users\lekha\AppData\Local\Programs\Python\Python313\python.exe -m pip install --upgrade pip

Requirement already satisfied: numpy in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (2.3.2)

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: C:\Users\lekha\AppData\Local\Programs\Python\Python313\python.exe -m pip install --upgrade pip

In [4]:
s1 = pd.Series([11,12,13,14,15], index=['a','b','c','d','e'],dtype= 'float')
s1

a    11.0
b    12.0
c    13.0
d    14.0
e    15.0
dtype: float64

In [6]:
s2=pd.Series({'raj':65,'aba':45,'rds':50})
s2

raj    65
aba    45
rds    50
dtype: int64

In [7]:
d1=pd.DataFrame([43,44,45,46,47])
d1

    0
0  43
1  44
2  45
3  46
4  47

In [12]:
d1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
columns=['maths','sci','chem'],
index =['123','456','789'])
d1

     maths  sci  chem
123      1    2     3
456      4    5     6
789      7    8     9

In [19]:
dic=[{'alex':1,'joe':2},{'ema':5,'dora':3,'alix':2},{'abc':1,'cdd':2}]
pd.DataFrame(dic,index=['a','b','c'])

_IncompleteInputError: incomplete input (2464784049.py, line 3)

In [21]:
d1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
columns=['maths','sci','chem'],
index =['123','456','789'])
print(d1['maths'])

123    1
456    4
789    7
Name: maths, dtype: int64

In [31]:
d3 = pd.DataFrame({
    'a': [9,8,7],
    'b': [6,5,4],
    'c': [3,2,1]
})
d3['d']=d3['a']*d3['b']
d3['e']=d3['c']+d3['d']
d3
pop=d3.pop('b')
print(pop)
del d3['d']

0    6
1    5
2    4
Name: b, dtype: int64

In [34]:
d3 = pd.DataFrame({
    'a': [9,8,7],
    'b': [6,5,4],
    'c': [3,2,1]
})
d3['d']=d3['a']*d3['b']
d3['e']=d3['c']+d3['d']
del d3['d']
print(d3)

   a  b  c   e
0  9  6  3  57
1  8  5  2  42
2  7  4  1  29

In [38]:
d3 = pd.DataFrame({
    'a': [9,8,7],
    'b': [6,5,4],
    'c': [3,2,1]
})
d3['d']=d3['a']*d3['b']
d3['e']=d3['c']+d3['d']
d3.insert(1,'x',d3['c'])
print(d3)

   a  x  b  c   d   e
0  9  3  6  3  54  57
1  8  2  5  2  40  42
2  7  1  4  1  28  29

In [39]:
d = {'c':1, 'new1':33,'e':22}
df1=d3._append(d,ignore_index=True)
df1

     a    x    b  c     d   e  new1
0  9.0  3.0  6.0  3  54.0  57   NaN
1  8.0  2.0  5.0  2  40.0  42   NaN
2  7.0  1.0  4.0  1  28.0  29   NaN
3  NaN  NaN  NaN  1   NaN  22  33.0

In [48]:
d4=pd.DataFrame({'abc':np.random.randint(2,6,size=(10)),'bcd':np.random.randint(4,10,size=(10)),'cde':np.random.randint(6,10,size=(10))})
d4

   abc  bcd  cde
0    5    8    7
1    4    9    8
2    4    4    6
3    2    7    9
4    5    8    8
5    5    4    7
6    3    5    9
7    5    7    6
8    5    4    8
9    2    4    8

In [46]:
d4 = pd.DataFrame({
    'abc': np.random.randint(2, 6, size=10),
    'bcd': np.random.randint(4, 10, size=10),
    'cde': np.random.randint(6, 10, size=10)
})

print(d4)

   abc  bcd  cde
0    5    4    9
1    3    7    8
2    5    7    7
3    3    8    6
4    2    4    7
5    3    8    6
6    2    6    8
7    3    7    6
8    2    4    6
9    5    7    8

In [49]:
d4.tail()

   abc  bcd  cde
5    5    4    7
6    3    5    9
7    5    7    6
8    5    4    8
9    2    4    8

In [50]:
d4.head()

   abc  bcd  cde
0    5    8    7
1    4    9    8
2    4    4    6
3    2    7    9
4    5    8    8

In [53]:
d4.info()
d4.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     10 non-null     int32
 1   bcd     10 non-null     int32
 2   cde     10 non-null     int32
dtypes: int32(3)
memory usage: 252.0 bytes

             abc    bcd        cde
count  10.000000  10.00  10.000000
mean    4.000000   6.00   7.600000
std     1.247219   2.00   1.074968
min     2.000000   4.00   6.000000
25%     3.250000   4.00   7.000000
50%     4.500000   6.00   8.000000
75%     5.000000   7.75   8.000000
max     5.000000   9.00   9.000000

In [55]:
print(d4.loc[5,'cde'])

7

In [58]:
newd4= d4.loc[2:5 , ['bcd','cde']]
print(newd4)

   bcd  cde
4    8    8
5    4    7
6    5    9
7    7    6
8    4    8

In [60]:
newd42=d4.loc[[3,4,7],['abc','cde']]
print(newd42)

   abc  cde
3    2    9
4    5    8
7    5    6

print(d4.iloc[4,2])

In [61]:
print(d4.iloc[4,2])

8

In [62]:
print(d4.iloc[2:5,[0,2]])

   abc  cde
2    4    6
3    2    9
4    5    8

In [64]:
print(d4.iloc[[2,5,7],[0,2]])

   abc  cde
2    4    6
5    5    7
7    5    6

In [65]:
d4.abc

0    5
1    4
2    4
3    2
4    5
5    5
6    3
7    5
8    5
9    2
Name: abc, dtype: int32

In [67]:
d4.bcd.values

array([8, 9, 4, 7, 8, 4, 5, 7, 4, 4], dtype=int32)

In [69]:
d4['sub']=d4.abc.values+d4.bcd.values
d4

   abc  bcd  cde  sub
0    5    8    7   13
1    4    9    8   13
2    4    4    6    8
3    2    7    9    9
4    5    8    8   13
5    5    4    7    9
6    3    5    9    8
7    5    7    6   12
8    5    4    8    9
9    2    4    8    6

In [126]:
import pandas as pd
a = [['rk',102,20000],['rama',103,np.nan],['teen',104,25000]]
df1=pd.DataFrame(a, columns=['name','id','salary'])
df1
y=df1[df1.salary>20000]
print(y)
y[['id','salary']]
new_row = pd.DataFrame([{'name': np.nan, 'id': 105, 'salary': np.nan}])
new = pd.concat([df1, new_row], ignore_index=True)
print(new)
print(new.isnull().sum())
print(new.fillna({'name':'abc'}))
print(new.dropna())
df1.drop([1],axis=0,inplace=True)
print(df1)

   name   id   salary
2  teen  104  25000.0
   name   id   salary
0    rk  102  20000.0
1  rama  103      NaN
2  teen  104  25000.0
3   NaN  105      NaN
name      1
id        0
salary    2
dtype: int64
   name   id   salary
0    rk  102  20000.0
1  rama  103      NaN
2  teen  104  25000.0
3   abc  105      NaN
   name   id   salary
0    rk  102  20000.0
2  teen  104  25000.0
   name   id   salary
0    rk  102  20000.0
2  teen  104  25000.0

In [133]:
df=pd.DataFrame({'Animal':['Falcon','Falcon','Parrot','Parrot'],'Max speed':[380,140,180,200],'Wind Speed':[200,240,290,300]})
df

   Animal  Max speed  Wind Speed
0  Falcon        380         200
1  Falcon        140         240
2  Parrot        180         290
3  Parrot        200         300

In [135]:
df.groupby(['Animal']).mean()

        Max speed  Wind Speed
Animal
Falcon      260.0       220.0
Parrot      190.0       295.0

In [136]:
df.T

                 0       1       2       3
Animal      Falcon  Falcon  Parrot  Parrot
Max speed      380     140     180     200
Wind Speed     200     240     290     300

In [145]:
import pandas as pd
data={'Firstname':['Arun','teen','lekh','chandu'],
       'Lastname':['kumar','singh','reddy','goud'],
       'Employment type':['service','Business','student','servise'],
       'Country':['India','USA','USA','Swedan']}
df = pd.DataFrame(data,columns=['Firstname','Lastname','Employment type','Country'])
df

  Firstname Lastname Employment type Country
0      Arun    kumar         service   India
1      teen    singh        Business     USA
2      lekh    reddy         student     USA
3    chandu     goud         servise  Swedan

In [148]:

df1=pd.get_dummies(df['Employment type'], dtype=int)
df2=pd.get_dummies(df['Country'],dtype=int)
df1
df2

   India  Swedan  USA
0      1       0    0
1      0       0    1
2      0       0    1
3      0       1    0

In [152]:
frames=[df,df1,df2]
result=pd.concat(frames,axis=1)
print(result)
result.drop(['Employment type','Country'],axis=1,inplace=True)
result

  Firstname Lastname Employment type Country  Business  service  servise  \
0      Arun    kumar         service   India         0        1        0
1      teen    singh        Business     USA         1        0        0
2      lekh    reddy         student     USA         0        0        0
3    chandu     goud         servise  Swedan         0        0        1

   student  India  Swedan  USA
0        0      1       0    0
1        0      0       0    1
2        1      0       0    1
3        0      0       1    0

  Firstname Lastname  Business  service  servise  student  India  Swedan  USA
0      Arun    kumar         0        1        0        0      1       0    0
1      teen    singh         1        0        0        0      0       0    1
2      lekh    reddy         0        0        0        1      0       0    1
3    chandu     goud         0        0        1        0      0       1    0

In [159]:
ind_weather=pd.DataFrame({
    "city":['bombay','hyd','chennai'],
    "temp":[50,40,78],
    "humid":[60,74,85]
})
US_weather=pd.DataFrame({
    "city":['Cali','WA','chicago'],
    "temp":[43,56,70],
    "humid":[57,65,48]
})
df=pd.concat([ind_weather,US_weather],ignore_index=True)
df

      city  temp  humid
0   bombay    50     60
1      hyd    40     74
2  chennai    78     85
3     Cali    43     57
4       WA    56     65
5  chicago    70     48

In [168]:
emp={'Name':['teen','lekh','chand','teen'],
     'Age':[30,20,21,30]}
info=pd.DataFrame(emp)
print(info)
print('------------------')
info=info.drop_duplicates()
print(info)

    Name  Age
0   teen   30
1   lekh   20
2  chand   21
3   teen   30
------------------
    Name  Age
0   teen   30
1   lekh   20
2  chand   21

In [173]:
def cal_sum(pand):
    return pand+1
data=pd.DataFrame({
    'x':[12,13,14],
    'y':[21,22,23]
})
data
x=data.apply(cal_sum)
x

    x   y
0  13  22
1  14  23
2  15  24

In [174]:
data=pd.DataFrame({
    'name':['teen','lekh','chand','sara','souy'],
    'age':[21,22,23,25,30],
    'Group':['CSE','EEE','ECE','CSE','EEE']
})
data

    name  age Group
0   teen   21   CSE
1   lekh   22   EEE
2  chand   23   ECE
3   sara   25   CSE
4   souy   30   EEE

In [178]:
d=pd.Categorical(data['Group'])
d

['CSE', 'EEE', 'ECE', 'CSE', 'EEE']
Categories (3, object): ['CSE', 'ECE', 'EEE']

In [179]:
!piplt install matplotlib
from matplotilib import pyplot as plt
import numpy as np
!piip install seaborn

Collecting matplotlib
  Downloading matplotlib-3.10.6-cp313-cp313-win_amd64.whl.metadata (11 kB)
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.3.3-cp313-cp313-win_amd64.whl.metadata (5.5 kB)
Collecting cycler>=0.10 (from matplotlib)
  Downloading cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Downloading fonttools-4.59.2-cp313-cp313-win_amd64.whl.metadata (111 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Downloading kiwisolver-1.4.9-cp313-cp313-win_amd64.whl.metadata (6.4 kB)
Requirement already satisfied: numpy>=1.23 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (2.3.2)
Requirement already satisfied: packaging>=20.0 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (25.0)
Collecting pillow>=8 (from matplotlib)
  Downloading pillow-11.3.0-cp313-cp313-win_amd64.whl.metadata (9.2 kB)
Collecting pyparsing>=2.3.1 (from matplotlib)
  Downloading pyparsing-3.2.3-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\lekha\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)
Downloading matplotlib-3.10.6-cp313-cp313-win_amd64.whl (8.1 MB)
   ---------------------------------------- 0.0/8.1 MB ? eta -:--:--
   ------------------------------------- -- 7.6/8.1 MB 38.7 MB/s eta 0:00:01
   ---------------------------------------- 8.1/8.1 MB 35.0 MB/s eta 0:00:00
Downloading contourpy-1.3.3-cp313-cp313-win_amd64.whl (226 kB)
Downloading cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.59.2-cp313-cp313-win_amd64.whl (2.3 MB)
   ---------------------------------------- 0.0/2.3 MB ? eta -:--:--
   ---------------------------------------- 2.3/2.3 MB 29.1 MB/s eta 0:00:00
Downloading kiwisolver-1.4.9-cp313-cp313-win_amd64.whl (73 kB)
Downloading pillow-11.3.0-cp313-cp313-win_amd64.whl (7.0 MB)
   ---------------------------------------- 0.0/7.0 MB ? eta -:--:--
   ---------------------------------------- 7.0/7.0 MB 34.5 MB/s eta 0:00:00
Downloading pyparsing-3.2.3-py3-none-any.whl (111 kB)
Installing collected packages: pyparsing, pillow, kiwisolver, fonttools, cycler, contourpy, matplotlib

   ---------------------------------------- 0/7 [pyparsing]
   ---------------------------------------- 0/7 [pyparsing]
   ---------------------------------------- 0/7 [pyparsing]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----- ---------------------------------- 1/7 [pillow]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ----------------- ---------------------- 3/7 [fonttools]
   ---------------------------- ----------- 5/7 [contourpy]
   ---------------------------- ----------- 5/7 [contourpy]
   ---------------------------- ----------- 5/7 [contourpy]
   ---------------------------- ----------- 5/7 [contourpy]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------- ----- 6/7 [matplotlib]
   ---------------------------------------- 7/7 [matplotlib]

Successfully installed contourpy-1.3.3 cycler-0.12.1 fonttools-4.59.2 kiwisolver-1.4.9 matplotlib-3.10.6 pillow-11.3.0 pyparsing-3.2.3

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: C:\Users\lekha\AppData\Local\Programs\Python\Python313\python.exe -m pip install --upgrade pip

ModuleNotFoundError: No module named 'matplotilib'